<template>
  <h1>Отзывы клиентов</h1>
  <div v-for="comment in allComments" :key="comment.id" class="comment">
      <div class="comment-item">
        <img
        src="https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRmgRRWWJoxWiRu5d3_NP3vVJNGIuRIlEjsPg&usqp=CAU"
        class="profile-img"
        alt="profile"
      />
        Автор: <strong>{{ comment.author }}</strong>
      </div>
      <div class="comment-item">
        Гостиница: <strong>{{ comment.title }}</strong>
      </div>
      <div class="comment-item">
        Звезд: <strong>{{ comment.stars }}</strong>
      </div>      
    <div class="comment-item text">
      Комментарий: <br /><strong>{{ comment.body }}</strong>
    </div>
  </div>
  <!-- <h1>Каким должен быть контент на гостиничном сайте</h1>
  <h2>Адрес и телефон</h2>
  <p>
    По запросу «гостиница уют» Яндекс покажет 27 миллионов страниц. И если на
    официальном сайте отеля с таким названием не указан город, то потенциальные
    гости его не отыщут. Это грозит отелям даже с уникальным названием. Для
    удобства гостей укажите все контакты в шапке сайта: географический адрес:
    название города, улицы, номер дома; адреса электронной почты. Так гость
    сможет уточнить детали брони или запросить документы; номер телефона с
    функцией быстрого набора для тех, кто зашел на сайт со смартфона.
  </p>

  <h2>Продающая фотография</h2>
  <p>
    Гостю важно, где он будет жить: как выглядит отель, номера, есть ли ресторан
    или бассейн. Об этом лучше расскажут яркие фотографии. Покажите гостю в
    основном слайд-шоу на главной странице:
  </p>
  <ul>
    <li>фасад здания, чтобы он быстро нашел вас в незнакомом городе;</li>
    <li>номера с изображением кровати, санузла, вид из окна;</li>
    <li>лобби и стойку регистрации;</li>
    <li>бассейн, ресторан, комнату для SPA-процедур (при наличии):</li>
    <p>
      60% людей воспринимают информацию визуально. Поэтому важно выставлять на
      сайт качественные фотографии. Закажите профессиональную фотосессию у
      фотографа с опытом интерьерной съемки.
    </p>
  </ul>
  <h2>Модуль онлайн-бронирования</h2>
  <p>
    Наши аналитики подсчитали, что 93% клиентов даже не начинают заполнять форму
    бронирования по запросу и закрывают вкладку сайта. Гость хочет сделать бронь
    прямо на сайте, не дожидаясь звонка о подтверждении. Он ждет от системы
    онлайн-бронирования удобства и ясности на каждом шаге. Шаг 1. Клиент
    выбирает в календаре нужные даты. Если на этот период нет свободных номеров,
    система должна предложить варианты ближайшего заезда. Шаг 2. На этапе выбора
    номера покажите гостю:
  </p> -->
</template>

<script>
import { mapGetters } from "vuex";
export default {
  computed: mapGetters(["allComments"]),
};
</script>

<style lang="scss" scoped>
p {
  text-align: justify;
}
li {
  text-align: start;
}
.profile-img {
  height: 50px;
}
.comment {
  display: flex;
  justify-content: space-between;
  align-items: center;
  flex-direction: column;
  border:1px solid teal;
  border-radius: 50px;

  &-item {
    margin: 10px 0;

    width: 280px;
  }
  .text {
    width: 600px;
  }
}
</style>
