<template>
  <div>
      <h1>Поиск лучших предложений</h1>
      <h3>От роскошных отелей до спокойных гостиниц</h3>
      <h3>Бронируйте гостиницы в самых популярных регионах России по выгодным ценам!</h3>
      <div class="content-info">
        <div v-for="item in info" :key="item.id" class="info">
          <strong class="info-title">{{item.title}}</strong>
          <p class="info-text">{{item.body}}</p>
        </div>        
      </div>
      <div>
        <h4>Безопасность платежей и защита данных</h4>
        <p>Мы сотрудничаем с ведущими банками и платёжными системами. Они помогают проводить онлайн-платежи по безопасным соединениям с максимальной скоростью. Мы используем передовые технологии шифрования и надёжно защищаем данные ваших банковских карт.</p>
      </div>
  </div>
</template>

<script>
export default {
data: () =>({
  info: [
    {title:'Низкие цены', body:'Мы работаем напрямую с тысячами отелей, десятками поставщиков и контролируем цены на номера. Поэтому у нас всегда есть выгодные предложения на популярные направления.'},
    {title:'Отели по всему миру',body:'У нас более 1 700 000 вариантов размещения по всему миру. Это отели, хостелы, апартаменты, виллы и даже кемпинги. В любой сезон вы найдёте то, что подходит именно вам.'},
    {title:'Гибкая оплата',body:'Вы сами выбираете способ оплаты. Можно оплатить бронь сразу — мы поддерживаем большинство банковских карт. А можно заплатить в отеле при заезде.'},
    {title:'Заботливая поддержка 24/7',body:'Операторы поддержки помогут с выбором отеля и бронированием. Если вопрос возник в поездке, оператор будет на связи и найдёт решение в кратчайший срок.'},
    {title:'Достоверные отзывы',body:'Мы собираем и публикуем отзывы путешественников, а также добавляем отзывы TripAdvisor. Так вы получаете ещё больше информации об отеле.'},
    {title:'Бесплатное приложение',body:'Главное в мобильном приложении — секретные цены. А ещё оно всегда под рукой. Бронируйте отели в метро, на работе и даже в аэропорту.'},
  ]
})
}
</script>

<style lang="scss">
.content-info {
    margin-top: 50px;
    display: flex;
    flex-wrap: wrap;
    justify-content: center;
}
.info {
  margin: 10px 20px;
  flex-wrap: wrap;
  background-color: rgba($color: grey, $alpha: 0.05);


    &-title{
      display: flex;
      align-items: left;
    }

    &-text {
      display: flex;
      text-align: left;
      max-width: 300px;
  }
}

</style>